#! python3
# -*- coding: utf-8 -*-
import sys
sys.path.insert(0, "..")
sys.path.insert(0, "../..")
sys.path.insert(0, "..\..")
from commands7 import *  # mine commands

s = """Егор Егоров, [13.09.17 23:53]
238568

Егор Егоров, [13.09.17 23:53]
поднял

Егор Егоров, [13.09.17 23:53]
238559

Егор Егоров, [13.09.17 23:53]
поднял

Егор Егоров, [13.09.17 23:54]
238557

Егор Егоров, [13.09.17 23:54]
поднял

Егор Егоров, [13.09.17 23:54]
228854

Егор Егоров, [13.09.17 23:54]
повесил

Егор Егоров, [13.09.17 23:54]
225772 - не успел, Серёге уже некогда было

Егор Егоров, [13.09.17 23:55]
219462 - закрыл заявку

Егор Егоров, [13.09.17 23:55]
т.к. работает

Егор Егоров, [13.09.17 23:55]
219461 - не успел по той же причине

Егор Егоров, [13.09.17 23:55]
219456 - поднял

Егор Егоров, [13.09.17 23:55]
219455 - поднял

Коля, [13.09.17 23:55]
Егор, я тебе говорил на почту писать

Егор Егоров, [13.09.17 23:56]
219450 - не успел

Егор Егоров, [13.09.17 23:56]
Ща скопирую на почту"""

print(s.strip(newline2))
